{
	"name": "Portfolio",
	"items": [
		{
			"name": "tunedin-webapp",
			"heading": "TunedIn Webapp",
			"released": "2014-04-30",
			"contents": [
				{
					"content": "Single page javascript web application for user second-screen viewing experience."
				},
				{
					"content": "This app features content recommendation for users, a real-time TV Guide and participation in live events."
				}
			],
			"points": [
				{
					"content": "Developed using the Javascript Meteor framework."
				},
				{
					"content": "Makes use of font icons to render smoothly on all screen sizes."
				},
				{
					"content": "Fully reactive app which updates itself in realtime."
				}
			],
			"url": "http://www.tunedin.de",
			"media": {
				"img": "tunedin-desktop-webapp"
			}
		},
		{
			"name": "tunedin-website",
			"heading": "TunedIn Website",
			"released": "2014-04-30",
			"contents": [
				{
					"content": "Company landing page for the Berlin based startup TunedIn."
				}
			],
			"points": [
				{
					"content": "Developed using a framework which generates static HTML files, concatenates and minifies JS and CSS."
				},
				{
					"content": "Using the LESS CSS framework, this site is easily optimised to run on tablet and mobile devices."
				}
			],
			"url": "http://get.tunedin.de",
			"media": {
				"img": "tunedin-desktop-website"
			}
		},
		{
			"name": "irish-times",
			"heading": "The Irish Times",
			"released": "2012-12-19",
			"contents": [
				{
					"content": "Overhauled version of the Irish Times news app for iOS and Android devices."
				},
				{
					"content": "App built natively for iOS and Android phones - plugging into existing infrastructure with solid performance and stability."
				}
			],
			"points": [
				{
					"content": "Developed natively in Objective C and Java."
				},
				{
					"content": "Downloads and caches content concurrently to ensure smooth user interface."
				},
				{
					"content": "Used a web based beta testing and crash reporting tool to pinpoint problems."
				}
			],
			"url": "https://itunes.apple.com/ie/app/id365544593?mt=8&affId=1736887",
			"media": {
				"img": "irishtimes-ios-app"
			}
		},
		{
			"name": "newswhip",
			"heading": "NewsWhip",
			"released": "2013-01-20",
			"contents": [
				{
					"content": "NewsWhip have devised a system to deliver news stories to users based on their popularity."
				},
				{
					"content": "Using their existing feed infrastructure, I was able to create a cross platform app using html5 and javascript."
				}
			],
			"points": [
				{
					"content": "Developed cross platform for easier portability to other devices."
				},
				{
					"content": "Makes use of most existing infrastructure to minimise back end development effort."
				},
				{
					"content": "Content cached to minimise impact on server infrastructure and device bandwidth."
				}
			],
			"url": "https://itunes.apple.com/ie/app/id569523615?mt=8&affId=1736887",
			"media": {
				"img": "newswhip-ios-app"
			}
		}
	]
}