{
	"name": "Portfolio",
	"items": [
		{
			"name": "tunedin-webapp",
			"heading": "TunedIn Webapp",
			"contents": [
				{
					"content": "Single page javascript web application for user second-screen viewing experience."
				},
				{
					"content": "This app features content recommendation for users, a real-time TV Guide and participation in live events."
				}
			],
			"points": [
				{
					"content": "Developed using the Javascript Meteor framework."
				},
				{
					"content": "Makes use of font icons to render smoothly on all screen sizes."
				},
				{
					"content": "Fully reactive app which updates itself in realtime."
				}
			],
			"url": "http://webapp.tunedin.de",
			"media": {
				"web": "",
				"mobile": "",
				"video": ""
			}
		},
		{
			"name": "tunedin-website",
			"heading": "TunedIn Website",
			"contents": [
				{
					"content": "Company landing page for the Berlin based startup TunedIn."
				}
			],
			"points": [
				{
					"content": "Developed using a framework which generates static HTML files, concatenates and minifies JS and CSS."
				},
				{
					"content": "Using the LESS CSS framework, this site is easily optimised to run on tablet and mobile devices."
				}
			],
			"url": "http://www.tunedin.de",
			"media": {
				"web": "",
				"mobile": "",
				"video": ""
			}
		},
		{
			"name": "irish-times",
			"heading": "The Irish Times",
			"contents": [
				{
					"content": "The Irish Times gave us the task of overhauling their news app for iPhone and Android platforms."
				},
				{
					"content": "As one of the lead developers on this project, I was responsible for smoothly integrating existing news infrastructure into a fast, feature rich and robust app."
				}
			],
			"points": [
				{
					"content": "Developed natively in Objective C and Java."
				},
				{
					"content": "Downloads and caches content concurrently to ensure smooth user interface."
				},
				{
					"content": "Used a web based beta testing and crash reporting tool to pinpoint problems."
				}
			],
			"url": "https://itunes.apple.com/ie/app/id365544593?mt=8&affId=1736887",
			"media": {
				"web": "",
				"mobile": "",
				"video": ""
			}
		},
		{
			"name": "newswhip",
			"heading": "NewsWhip",
			"contents": [
				{
					"content": "NewsWhip are a Dublin based startup who have devised a system to deliver news stories to users based on their popularity."
				},
				{
					"content": "Using their existing feed infrastructure, I was able to create a cross platform app using html5 and javascript."
				}
			],
			"points": [
				{
					"content": "Developed cross platform for easier portability to other devices."
				},
				{
					"content": "Makes use of most existing infrastructure to minimise back end development effort."
				},
				{
					"content": "Content cached to minimise impact on server infrastructure and device bandwidth."
				}
			],
			"url": "https://itunes.apple.com/ie/app/id569523615?mt=8&affId=1736887",
			"media": {
				"web": "",
				"mobile": "",
				"video": ""
			}
		},
		{
			"name": "paddypower-casino",
			"heading": "Paddy Power Casino",
			"contents": [
				{
					"content": "An overhaul was needed for the The Paddy Power Casino website to deliver a wider selection of games and customised content to the customer."
				},
				{
					"content": "The site was redeveloped and redesigned with a custom built CMS and access to a wider variety of games."
				}
			],
			"points": [
				{
					"content": "Optimised delivery of images, CSS and Javascript to minimise load on servers."
				},
				{
					"content": "CMS developed to allow content owners to deliver custom content to customer groups."
				},
				{
					"content": "Smooth and secure integration of website with existing infrastructure."
				}
			],
			"url": "https://itunes.apple.com/ie/app/id569523615?mt=8&affId=1736887",
			"media": {
				"web": "",
				"mobile": "",
				"video": ""
			}
		}
	]
}